 #+title: FC
#+EXPORT_FILE_NAME: index.html
#+setupfile: docs/setup-rto.org

* Introduction

This package performs 3+1 neutrino oscillation analysis for MicroBooNE. It is designed to set exclusion limits (or determine allowed regions) using frequentist statistical methods, including Feldman-Cousins, CLs, and Wilks' theorem, for nested hypothesis testing.

Note: The package is a PyTorch adaptation of CPU-based TOsc package 

* Install

~Limitor~ installs in the "usual Python way".  Use of ~pip~ and a Python
virtual environment is recommended. Needs PyTorch + ROOT CERN

#+begin_example
python3 -m venv venv
source venv/bin/activiate
git clone https://github.com/rennney/Limitor.git
cd Limitor
pip install -e .
#+end_example

* Usage

The ~limitor~ command line user interface provides online help:

#+begin_src shell :exports both :results output code :wrap example
limitor
#+end_src

#+RESULTS:
#+begin_example
Usage: limitor [OPTIONS] COMMAND [ARGS]...

  Limitor command line interface

Options:
  -s, --store PATH     File for primary data storage (input/output)
  -o, --outstore PATH  File for output (primary only input)
  --help               Show this message and exit.

Commands:
  run-tosc
#+end_example

